const risk=`                                                                                                      服务协议
</br>
欢迎注册成为KKG网站(即www.kkgold.com，包括PC端、移动端及应用程序，以下简称“本网站”或“KKG”)用户，使用KKG为您提供的服务。
</br>重要提示：
杭州墙弄珠宝有限公司及其运营的KKG网站依据本协议的约定为KKG用户（以下简称“用户”）提供服务。本协议在用户和杭州墙弄珠宝有限公司间具有法律效力。    
    在您决定成为本网站用户前，请您认真阅读、充分理解本协议各条款，特别是其中所涉及的免除或限制KKG责任的条款、对用户权利限制的条款等。请您审慎选择接受或不接受本协议。
    除非您不加修改地无条件完全接受本协议所包含的条款、条件和本网站即时刊登的通告，并且遵守有关互联网的相关法律、法规、规定及本网站规则，否则您无权使用KKG于本协议项下所提供的服务。
    您一经注册或使用KKG服务即视为您对本协议全部条款已充分理解并完全接受。此后，您不得以未阅读本服务条款内容作任何形式的抗辩。
    第一条 服务接受与确认
1.1用户一经勾选同意KKG服务条款并按照本网站规定的注册程序开始注册，即表示用户已充分阅读、理解并同意接受本服务协议的条款和条件，并签署了本服务协议，本服务协议即在用户和杭州墙弄珠宝有限公司之间产生法律效力。 
1.2用户一经注册即视为用户同意本网站在将来任何时刻有权根据公司业务需求、互联网的发展或中华人民共和国有关法律、法规的变化，不时地制定、修改用户服务条款或网站各类规则，并在KKG上予以公布。经修订后的协议、规则一经本网站公布，立即自动生效。用户的权利以及义务的表述，均以最新的服务条款为准。KKG特别提醒用户，应不时地关注本协议及附属规则的变更。若用户在相关协议、规则内容公告变更后继续使用本服务的，表示用户已充分阅读、理解并接受修改后的协议、规则；若用户不同意相关变更, 用户可以立即停止使用本服务，同时本网站有权不经任何告知终止、中止本协议或者限制用户进入本网站的全部或者部分板块且不承担任何法律责任。但该终止、中止或限制行为并不能豁免用户在本网站已经进行的消费项下所应承担的义务。
1.3除非另有书面约定，KKG向用户发出的任何通知除通过KKG购物系统站内信发送外，其余均以电子邮件或者手机短信形式发送到通知发出之时用户注册信息所记载的电子邮件地址或/和手机号码，站内信、电子邮件或者短信一经发出即视为送达并产生相应法律效力。用户应密切关注会员信息、邮箱及手机信息。用户同意，KKG按照通知发出之时用户会员信息所记载的电子邮件地址或/和手机号码发出的通知，KKG不对用户未能收到电子邮件或短信通知承担任何责任。
用户若因注册登记的电子邮件地址或手机号码发生变化而未及时登录会员中心进行资料更新，以致于KKG通知无法送达或者用户收不到通知，亦或因用户未及时关注邮箱及手机信息而导致相关通知内容失效的，KKG不承担任何责任，所有后果应由用户自行承担。
1.4用户确认并且同意自行主动、及时登陆商城或电子邮箱收取和查看每一份电子帐单/电子通知，以确定是否存在基于任何原因（包括但不限于伪造、变造、欺诈、无权限、或客户或任何其他人士的过失）所产生的任何错误、不一致等。
用户未在每一份电子帐单/电子通知发出之日起三日内查看并将任何错误、疑问以KKG接受的方法和形式通知KKG，则该份电子帐单/电子通知自发出后的第四日起生效。
1.5用户确认，电子账单是用户账户余额的最终证明，电子账单生效之后，对用户具有约束力，并且用户应被视作同意放弃就此对KKG提出异议或实施任何救济的权利，以及放弃对KKG的任何索赔和责任，且无论该等索赔或责任是否由于KKG的过失所导致。
    第二条 服务内容
2.1KKG致力于为有黄金、白银等贵金属及其饰品消费需求的消费者搭建一个安全、透明、便捷的购物网站，竭诚为用户提供黄金、白银等贵金属及其饰品（以下统称“黄金”）产品推介、购买、交付（含自提、物流或寄存等）、回收、货款的结算、消费资金充值、提现等服务。您注册成为用户之后，可以通过用户名和密码和/或手机短信验证登录KKG购物系统进行商品信息查询、资金充值/提现、购买及卖出实物黄金、消费记录查阅、服务商信息更新、密码重置以及参加KKG的市场活动等。具体内容以用户登录KKG购物系统时商城提供的服务内容为准。部分服务需要用户完成身份认证才能享用。用户因未完成身份认证而无法享受服务的，KKG不承担任何责任。
    2.2用户确认，其在KKG上按服务流程所确认的状态，将成为KKG为您进行相关操作（包括但不限于合同订立、款项结算、物流安排等）的唯一依据。用户同意KKG有权按相关指令依据本协议和/或有关文件和规则对相关事项进行处理。因用户未能及时对服务状态进行修改、确认而造成的损失由用户自行负责，KKG不承担任何责任。
    2.3KKG提供的各种商品信息及资料仅供用户参考，用户应考虑实际情况审慎抉择、独立判断并作出决策。用户应知悉黄金白银等贵金属的价格波动风险，全款购买（或预付款锁定价格后）发生后产生的一切风险均由用户自行承担。此外，如果KKG发现因系统故障或其他任何原因导致的处理错误，KKG都有权纠正该错误（包括无条件取消在该错误存续期间客户提交的订单），用户有义务根据KKG有关纠正错误的通知进行相应操作。
2.4KKG基于运营管理的需要，保留在无须发出书面通知、仅在KKG网站公示的情况下暂时或永久地更改或停止部分服务、增加或者完善服务功能的权利。
第三条 服务费用 
3.1当用户使用KKG服务时，KKG可能会向用户收取（或代为收取）相关服务费用。各项服务收费以用户使用KKG服务时KKG上所公示之收费方式说明或双方另行签订的协议为准。KKG保留单方面制定及调整服务收费的权利。用户签署本协议即表示用户同意并且授权KKG有权从用户的账户直接扣收服务费用及/和与服务相关的其他任何费用，且扣收时无需另行通知或征询用户意见。
3.2用户在使用KKG服务过程中可能需要向第三方（如银行或第三方支付公司等服务提供机构）支付一定的费用，具体收费标准详见第三方网站相关页面或KKG的提示。用户了解并确认KKG并非银行或第三方支付机构，无法提供充值或提现等金融服务，不对前述服务的成功做任何承诺，也不承担与此相关的责任，用户与银行或者第三方支付机构之间就费用支付等事项产生的争议或纠纷，与KKG无关，KKG就此不承担任何责任。
3.3用户在KKG消费而与其他方签订协议的，其他方有权按照相关协议的约定向用户收取相关费用。
3.4用户因消费行为而发生的所有应纳税赋，以及相关硬件、软件、通讯、网络服务及其他方面的费用均由用户自行承担。
第四条 风险提示 
4.1用户了解并认可，任何通过KKG进行的消费并不能避免以下风险的产生，KKG不能也没有义务为如下风险负责： 
4.1.1宏观经济风险：因宏观经济形势变化，可能引起价格等方面的异常波动，用户有可能遭受损失；
4.1.2政策风险：有关法律、法规及相关政策、规则发生变化，可能引起价格等方面异常波动，用户有可能遭受损失；
4.1.3利率风险：市场利率变化可能对购买或持有产品的价值产生影响；
4.1.4不可抗力因素导致的风险；
4.1.5因用户的过错导致的任何损失 ，该过错包括但不限于：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、用户使用的计算机系统被第三方侵入、用户委托他人代理操作时他人恶意或不当操作而造成的损失。
4.2KKG不对任何用户及/或任何服务提供任何担保或条件，无论是明示、或默示的。KKG不能也不试图对用户发布的信息进行控制，对该等信息，KKG不承担任何形式的证明、鉴定服务。KKG不能完全保证网站内容的真实性、充分性、可靠性、准确性、完整性和有效性，并且无需承担任何由此引起的法律责任。用户应当依赖于自身的独立判断进行消费，用户应对其作出的判断承担全部责任。
4.3以上并不能揭示用户通过KKG消费的全部风险及市场的全部情形。用户在做出消费决策前，应全面了解相关规则，谨慎决策，并自行承担全部风险。
第五条 用户保证与承诺
5.1用户承诺严格遵守相关法律、法规、政府规章及一切使用互联网之国际惯例，遵守所有与KKG服务有关的网络协议、规则和程序，合法使用KKG提供的资讯或服务。
5.2用户同意并保证不为任何非法目的或以任何非法方式使用KKG服务，不利用KKG服务从事侵害他人权益或违法之行为，若有违反者应负所有法律责任。上述行为包括但不限于：
    5.2.1反对宪法所确定的基本原则，危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一的行为；
5.2.2侵害他人名誉、隐私权、商业秘密、商标权、著作权、专利权、其他知识产权及其他权益的行为；
5.2.3违反依法律或合约所应负之保密义务的行为；
5.2.4冒用他人名义使用KKG服务的行为；
5.2.5从事任何不法行为，如贩卖枪支、毒品、禁药、盗版软件或其他违禁物；
5.2.6提供赌博资讯或以任何方式引诱他人参与赌博的行为；
5.2.7从事洗钱、套现或进行传销活动等行为；
5.2.8从事任何可能含有电脑病毒或是可能侵害KKG服务系统、资料等行为；
5.2.9利用KKG服务系统进行可能对互联网或移动网正常运转造成不利影响之行为；
5.2.10侵犯KKG的商业利益，包括但不限于发布非经KKG许可的商业广告；
5.2.11利用KKG服务上传、展示或传播虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
5.2.12其他KKG有正当理由认为不适当之行为。
5.3KKG保有依其单独判断删除KKG网站内各类不符合法律政策或不真实或不适当的信息内容而无须通知用户的权利，并无需承担任何责任。若用户未遵守以上规定的，KKG有权作出独立判断并采取暂停或关闭用户账户等措施，而无需承担任何责任。
5.4用户同意，由于用户违反本协议，或违反通过援引并入本协议并成为本协议一部分的文件，或由于用户使用KKG服务违反了任何法律或损害第三方的权利而造成任何第三方进行或发起的任何补偿申请或要求（包括律师费用），用户将对KKG及其关联方、合作伙伴、董事以及雇员给予全额补偿并使之不受损害。
5.5用户承诺，其通过KKG网站上传或发布的信息均真实有效，其向KKG提交的任何资料均真实、有效、完整、详细、准确。如因违背上述承诺，造成KKG或KKG其他使用方损失的，用户将承担全部赔偿责任。
5.6用户承诺在国家生效法律文书或行政处罚决定确认自己存在违法行为，或者本网站有足够事实依据可以认定用户存在违法或违反本服务协议的行为，KKG有权在任何形式的媒体上公布用户的违法、违约行为，并将相关信息计入任何与用户相关的信用资料，以及对用户的账户采取暂停或关闭等措施，而无需承担任何责任。 
第六条 用户注册
6.1KKG仅向符合中华人民共和国法律规定的具有完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人和机构提供服务。若用户不符合此等条件，请立即停止注册或停止使用本服务。 
6.2用户在注册KKG用户时必须提供用户本人真实、最新、有效及完整的信息资料，并保证电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性，保证KKG及其他用户可以通过上述联系方式与用户进行联系。若用户提供任何不真实、不准确、不完整或不能反映当前实际情况的资料，或KKG有合理理由怀疑该等资料不真实、不准确、不完整或不能反映当前情况，KKG有权拒绝用户的申请或者撤销用户的用户资格，并拒绝用户在目前或将来以任何形式使用KKG的服务，并不予任何赔偿或者退还任何已收取的服务费用。   
6.3如用户代表一家公司或其他法律主体进行注册登记，则用户声明和保证，用户已经获得该公司或其他法律主体的充分、完整授权，该公司或其他法律主体自愿且无条件地接受本协议条款的约束。
6.4用户必须维持并及时更新用户的注册资料，使其保持真实、准确、完整和反映当前情况，否则由此造成的用户权利不能全面有效地行使的责任由用户自行承担，KKG有权因此取消用户的用户资格，并不予任何赔偿或者退还任何已收取的服务费用。
6.5若用户冒用、盗用或以其他未经授权方式使用他人资料进行注册登记的，由此引起的一切后果概由用户独立承担。KKG获悉或怀疑用户未经授权使用他人资料注册的，可以采取立即注销用户的用户账户、暂停或者终止为用户提供服务等措施而无须承担任何责任。 
6.6用户在本网站注册，即视为用户同意本网站向用户注册时填写的电子邮箱、手机号码发送与本网站服务有关的电子邮件或短信。
第七条 账户管理
7.1用户注册成功后，KKG会为用户开通一个账户，作为用户使用KKG服务的唯一身份标识。该账户的所有权归属于KKG，用户仅拥有使用权。登录账户时，用户可以使用用户提供或确认的用户名、邮箱、手机号码或KKG允许的其他方式作为注册用户名进行登录，但在登录时用户必须输入用户设定并保管的账户密码。为保护用户的权益，用户在设定账户的密码时，请勿使用重复性或者连续数字等组成的简单密码。请用户对密码加以妥善保管，切勿将密码告知他人，因密码保管不善而造成的所有损失由用户自行承担。因黑客、病毒等非KKG原因导致用户的用户账户遭他人非法使用的，KKG不承担任何责任。
7.2KKG只允许每位用户使用一个KKG账户。如有证据证明或KKG有理由相信用户存在注册或使用多个KKG账户的情形，KKG有权采取冻结或关闭账户、取消订单、拒绝提供服务等措施，如给KKG及相关方造成损失的，用户还应承担赔偿责任。
7.3用户可以为其账户设定昵称，但该昵称不得违反法律的强制性规定、社会公序良俗以及侵犯他人合法权益。如KKG认为用户设定的昵称违反法律的强制性规定、社会公序良俗或者涉嫌侵犯他人合法权益的，KKG有权终止为用户提供服务，并注销用户的昵称。若用户不再是KKG的注册用户，对于用户的原注册账户的昵称，KKG可以将其开放给任意注册用户。
7.4用户对通过其账户所进行的活动、行为和事件依法享有权利和承担责任，且不得以任何形式转让账户、授权他人使用用户的账户以及与他人账户。
7.5鉴于网络服务的特殊性，KKG无义务审核是否是用户本人使用该组用户名及密码，仅审核用户名及密码是否与数据库中保存的一致，任何人只要输入的用户名及密码与数据库中保存的一致，即可凭借该组用户名及密码登陆并获得KKG所提供的各类服务，所以即使用户认为其账户登陆行为并非用户本人所为，KKG亦将不承担因此而产生的任何责任。用户确认，任何使用用户账户和密码登陆后在KKG的一切行为均代表用户本人，用户账户操作所产生的电子信息记录均为用户行为的有效凭据，并由用户本人承担由此产生的全部责任。
7.6用户因忘记密码或密码被盗向KKG重置密码时，必须提供完全、正确的注册信息及相关证明材料，否则KKG有权本着为用户保密的原则不予办理。 
7.7如用户发现有人冒用或盗用用户的账户及密码或任何其他未经合法授权之情形时，应立即以有效方式通知KKG，要求暂停相关服务。同时，用户理解KKG对用户的请求采取行动需要合理期限，而在KKG采取实际行动之前，用户应对任何或所有由未经授权人士使用此服务或此服务被用作未经授权用途负责，KKG对已执行的指令及(或)所导致的用户的损失不承担任何责任。
7.8用户冒用或者盗用他人账户及密码的，KKG及其合法授权主体保留追究实用户法律责任的权利。
7.9KKG不会通过电话、短信或电子邮件方式要求用户提供用户的账户、密码或其他安全信息，如果用户收到声称来自KKG的任何该等要求，用户不应对该等要求作出任何回应。否则，由此造成的损失由用户自行承担。
7.10用户可以通过在KKG参与相关活动等方式获得积分、返利和抵用券。积分和抵用券都具有特定的使用规则和有效期，将被清零；请用户不时关注用户账户中的积分或抵用券的有效期，在有效期届满前，KKG将不再另行作特别通知；KKG不对清零的积分或抵用券负责。对于恶意购买和以不正当手段获得的积分或抵用券，KKG有权作出独立判断并采取包含但不限于冻结用户的用户账户或清空积分、抵用券等措施。
7.11若用户在KKG成功注册账户后，连续24个月时间内未使用该账户(包括使用此账户进行消费，发表使用体验，参加KKG的有关活动以及使用其他服务)且期末账户余额为零的，则KKG有权对用户的账户进行清理。
7.12用户向KKG提出注销账户申请，经KKG审核同意后，由KKG注销该用户账户，本协议即告终止。但在注销该用户账户后，KKG仍有权：
（1）保留该用户的注册信息及过往的全部消费行为记录；
（2）如用户在账户注销前在KKG上存在违法行为或违反本协议的行为，KKG仍可行使本协议所规定的权利。
7.13在下列情况下，KKG可以通过注销用户账户的方式单方解除本协议：
（1）在用户违反本协议相关规定时，KKG有权暂停或终止向该用户提供服务。如该用户在KKG暂停或终止提供服务后，再一次直接或间接或以他人名义注册为KKG用户的，则KKG有权再次暂停或终止向该用户提供服务；
（2）一经发现用户注册信息中的内容是虚假的，KKG即有权终止向该用户提供服务；
（3）本协议修改或更新时，如用户表示不愿接受新的服务协议的，或者用户在使用KKG收费服务时未按规定向KKG支付相应的服务费用，KKG有权终止向该用户提供服务；
（4）KKG认为需终止提供服务的其他情况。
7.14用户理解并同意，即便在本协议终止及用户的服务被终止后，KKG仍有权：
（1）继续保存并使用用户的注册信息；
（2）继续向用户主张在其使用KKG服务期间因违反法律法规、本协议及网站规则而应承担的责任。
7.15用户理解并认同，因网站的特殊性，KKG没有义务对所有用户使用KKG网站服务的过程及行为进行事前及实时审查。但用户在KKG上有下列行为的，将授权KKG可以普通、非专业人员的知识水平标准或根据自己掌握的信息进行独立判断，并有权做出相应处理，而无须事先通知用户或取得用户同意：
（1）KKG有权对用户的注册信息及消费行为进行查阅，如发现注册信息或消费行为中存在任何问题的，有权向用户发出询问及要求改正或者做出冻结或关闭账户、取消订单等处理；
（2）用户违反本协议或KKG任何规则或有违反法律法规和地方规章的行为的，KKG有权删除其信息，禁止用户发言，限制用户消费，注销用户账户并按照相关法律规定向相关国家主管部门进行披露；
（3）如用户在KKG进行下列行为，KKG有权对用户采取删除其信息、禁止用户发言、限制用户消费、冻结或注销用户账户等限制性措施：包括：
a) 发布或以电子邮件或以其他方式传输存在恶意、虚假和侵犯他人人身财产权利内容的信息；
b) 进行并非以黄金产品消费为目的的异常操作；将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上传、发布、发送电子邮件或以其他方式传送；
c) 干扰或破坏KKG的服务，或与KKG和服务相连的服务器和网络；
d) 发布其他违反公共利益或可能严重损害KKG或其他用户合法利益的信息。
7.16用户理解并同意，当用户涉嫌侵犯他人合法权益， KKG有权在初步判断涉嫌侵权行为可能存在的情况下，在必要时可向权利人提供必要的已掌握的涉及用户的相关信息。
7.17用户理解并同意，当国家行政、司法机关主动依职权或根据他人的投诉，调查用户在KKG上的相关行为时，KKG有义务予以配合，并将所掌握的信息提供给上述国家机关。
第八条服务中断或故障
8.1用户同意，基于互联网的特殊性，KKG不担保服务不会中断，也不担保服务的及时性和/或安全性。系统因相关状况无法正常运作，使用户无法使用任何KKG服务或使用任何KKG服务时受到任何影响时，KKG对用户或第三方不负任何责任，前述状况包括但不限于：
KKG系统停机维护期间；
电信设备出现故障不能进行数据传输的；
    （3）由于黑客攻击、网络供应商技术调整或故障、网站升级、银行方面的问题等原因而造成的KKG服务中断或延迟；
    （4）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成KKG系统障碍不能执行业务的。
第九条 知识产权保护
9.1KKG网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由KKG或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
9.2非经KKG或其他权利人书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表KKG网站程序或内容。
9.3用户未经KKG的明确书面同意不许下载（除了页面缓存）或修改网站或其任何部分。用户不得对KKG网站或其内容进行转售或商业利用；不得收集和利用产品目录、说明和价格；不得对KKG网站或其内容进行任何衍生利用；不得为其他商业利益而下载或拷贝账户信息或使用任何数据采集、Robots或类似的数据收集和摘录工具。未经KKG的书面许可，严禁对KKG网站的内容进行系统获取以直接或间接创建或编辑文集、汇编、数据库或人名地址录（无论是否通过Robots、Spiders、自动仪器或手工操作）。另外，严禁为任何未经本使用条件明确允许的目的而使用KKG网站上的内容和材料。
9.4未经KKG明确书面同意，不得以任何商业目的对KKG或其任何部分进行复制、复印、仿造、出售、转售、访问、或以其他方式加以利用。未经KKG明确书面同意，用户不得用frame或运用frame技巧把KKG或其关联公司的商标、标识或其他专有信息（包括图像、文字、网页设计或形式）据为己有。未经KKG明确书面同意，用户不得以Meta Tags或任何其他"隐藏文本"方式使用KKG或其关联公司的名字和商标。任何未经授权的使用都会终止KKG所授予的允许或许可。
9.5尊重知识产权是用户应尽的义务，如有违反，用户应对KKG承担侵权赔偿等法律责任。
9.6对于任何侵害KKG知识产权的违法行为, KKG保留追究相关侵害人法律责任的权利。
隐私保护
    10.1KKG依照国家有关法律法规以及本协议的约定，采取各种严格的措施确保用户的信息安全，以防止未经合法授权的任何人、任何机构，包括本公司未经授权的员工或分支机构获取用户的信息。但是，鉴于技术限制，KKG不能确保用户的全部私人通讯及其他个人资料不会被泄露出去。
10.2KKG采用行业标准惯例以保护用户的资料。用户因履行本协议提供给KKG的信息、以及KKG自行收集的、经认证的用户信息，KKG不会恶意出售或免费共享给任何第三方，以下情况除外：
（1）提供独立服务且仅要求服务相关的必要信息的供应商，如印刷厂、邮递公司等；
（2）具有合法调阅信息权限并从合法渠道调阅信息的政府部门或其他机构，如公安机关、法院；
（3）KKG的关联实体；
（4）经网站使用方或网站使用方授权代表同意的第三方。
10.3KKG可能会通过与第三方进行合作来为用户提供相关服务，在此情况下，如该第三方同意承担与KKG同等的保护用户隐私的责任，则视为用户授权KKG可将用户的个人信息和资料提供给该第三方。
10.4用户同意，KKG可在KKG网站的某些网页上使用诸如“Cookies”的资料收集装置。
10.5用户同意，KKG可在KKG网站上，按照用户的行为自动追踪关于用户的某些资料。在不透露用户的隐私资料的前提下，KKG有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
10.6用户同意并授权KKG基于履行协议、解决争议、调停纠纷、保障KKG用户安全等合法目的而使用其用户资料（包括但不限于KKG持有的有关用户的档案中的资料，KKG从用户目前及以前在KKG上的活动所获取的其他资料，以及KKG通过其他方式自行收集的资料）。
10.7用户同意，KKG可能通过公开及私人资料来源收集用户的额外资料，以更好地了解用户的需求，并为用户度身订造KKG服务、解决争议。
10.8为防止个别用户通过KKG从事欺诈、洗钱或其他违法犯罪活动，保护KKG及广大用户的合法权益，用户同意并授权KKG可通过人工或自动程序对用户的个人信息资料进行评价。
10.9用户同意并授权KKG，在用户未能按照与KKG签订的包括但不限于服务协议等其他法律文件的约定履行自己应尽的义务，KKG有权对用户提供的及KKG自行收集的用户的个人信息和资料编辑入网站黑名单，并将该等个人信息和资料以及相关违约事实通过包括但不限于网络、报刊、电视等方式对任何第三方披露，或与任何第三方进行数据共享，由此可能给用户造成的任何损失，KKG不承担法律责任。
10.10司法机关、政府部门或其他监管机构根据有关法律、法规、规章及其他政府规范性文件的规定和程序，要求本网站提供用户的个人资料及消费信息的，本网站可据此提供用户的相关信息资料。
 第十一条 责任限制及不承诺担保
11.1除非另有明确的书面约定,本站及其所包含的或以其它方式通过本站提供给用户的全部信息、内容、材料、产品（包括软件）和服务，均是在"按现状"和"按现有"的基础上提供的。
11.2用户需根据自身风险承受能力及KKG发布信息的可靠程度独立判断，做出消费决策。消费产生的后果由用户自行承担。KKG不对用户服务提供任何形式的保证，包括但不限于以下事项：
    （1）KKG服务将符合用户的需求；
    （2）KKG服务将不受干扰、及时提供或免于出错。
    （3）用户经由KKG服务购买或取得之任何产品、服务、资讯或其他资料将符合用户的期望。
11.3KKG服务的合作单位所提供的服务品质及内容由该合作单位自行负责。KKG网站的内容可能涉及由第三方所有、控制或者运营的其他网站（以下简称“第三方网站”）。KKG不能保证也没有义务保证第三方网站上任何信息的真实性和有效性。用户确认按照第三方网站的服务协议使用第三方网站，而不是按照本协议。第三方网站的内容、产品、广告和其他任何信息均由用户自行判断并承担风险，而与KKG无关。用户经由KKG服务的使用下载或取得任何资料，应由用户自行考量且自负风险，因资料的下载而导致的任何损失由用户自行承担。
11.4用户由KKG任何工作人员处取得的建议、说明，均不构成KKG对服务的承诺和保证。由此产生的法律后果，KKG不承担任何责任。
11.5KKG不保证为向用户提供便利而设置的外部链接的准确性、有效性、安全性和完整性，同时，对于该等外部链接指向的不由KKG实际控制的任何网页上的内容，KKG不承担任何责任。
11.6KKG不保证本站所包含的或以其它方式通过本站提供给用户的全部信息、内容、材料、产品（包括软件）以及从本站发出的电子邮件、信息没有病毒或其他有害成分。
11.7不论在任何情况下，KKG均不对由于互联网设备正常维护，互联网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，暴乱，骚乱，灾难性天气（如火灾、洪水、风暴等），爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能履行或延迟履行承担责任。
11.8KKG合作机构提供的服务内容由该合作单位负责。用户享用相关服务时产生的争议、纠纷及损失，KKG不承担任何责任。
11.9除本协议另有规定外，在任何情况下，KKG对本协议所承担的违约赔偿责任总额不超过向用户提供该相关服务获得收益总额。
第十二条 违约赔偿 
12.1用户因违反本协议或本协议项下的其他文件，或违反了任何法律、法规的规定，给KKG造成损失的，应予赔偿，赔偿范围包括但不限于KKG的直接损失、间接损失以及维权费用等。
12.2用户因违反前款规定而侵害了第三方的权利，导致KKG遭受任何第三方提起的索赔、诉讼或行政责任，用户承诺无条件承担相应责任并使KKG免责。若因此给KKG造成损失的，应予赔偿，赔偿范围包括但不限于KKG的维权费用、名誉损失以及KKG向第三方支付的补偿金等。
第十三条 通知与送达
13.1除非另有书面约定，KKG对于用户的通知及任何其他的协议、告示或其他关于用户使用会员账户及服务的通知，用户同意KKG可通过KKG网站公告、站内信、电子邮件、手机短信、无线通讯装置等电子方式进行，该等通知于发送之日视为已送达收件人。
13.2用户若因注册登记的电子邮件地址或手机号码发生变化而未及时登录用户中心进行资料更新，以致于KKG通知无法送达或者用户收不到通知，亦或因用户未及时关注邮箱及手机信息而导致相关通知内容失效的，KKG不承担任何责任，所有后果应由用户自行承担。
13.3用户同意，KKG按照通知发出之时用户资料所记载的电子邮件地址或/和手机号码发出的通知，KKG不对用户未能收到电子邮件或短信通知承担任何责任。
13.4用户确认并且同意自行主动及时登陆用户中心或电子邮箱收取和查看每一份电子帐单/电子通知或站内信，以确定是否存在基于任何原因（包括但不限于伪造、变造、欺诈、无权限、或客户或任何其他人士的过失）所产生的任何错误、不一致等。
13.5用户未在每一份电子帐单/电子通知发出之日起三日内查看并将任何错误、疑问以书面形式通知KKG，则该份电子帐单/电子通知自发出后的第四日起生效。
13.6电子账单是账户余额的最终证明，电子账单生效之后，对用户具有约束力，并且用户应被视作同意放弃就此对KKG提出异议或实施任何救济的任何权利，放弃对KKG的任何索赔和责任，无论该等索赔或责任是否由于KKG的过失所导致。
第十四条 法律适用和管辖
14.1本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。没有相关法律规定的，参照国际惯例和/或行业惯例。
14.2因本协议引起的或与本协议有关的争议，各方应友好协商解决；协商不成的，按以下第 （1）  种方式解决：
（１）提交杭州仲裁委员会，按照申请仲裁时该会现行有效的仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。
（２）向甲方住所地有管辖权的人民法院起诉。

第十五条 修订与解释
15.1KKG保留对本服务条款进行修订、增补和解释的权利。
15.2KKG对本服务条款的修订、增补，经KKG在本网站发布或公开张贴、刊登广告或以KKG认为合适的其它方式向用户作出合理通知后生效。
15.3用户在本服务条款作出修订、增补生效日当日或其后，继续保留或使用本网站服务的，即视为用户已接受有关修订、增补，此等修订、增补即对用户具有约束力。
第十六条 其他
16.1本协议自用户点击注册时成立并生效。本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议约定之外，未赋予本协议各方其他权利。
16.2如本协议中的任何条款无论因何种原因被视为完全或部分无效或不具有执行力，该条应视为可分的，且不影响本协议的任何其余条款的有效性、约束力及可执行性。
16.3本协议中的标题仅为方便而设，不具法律或契约效果。
<p>杭州墙弄珠宝有限公司</p>
`
export default risk;